<?php 

/**
 * API接口 返回状态码定义
 *
 * @author leeprince <[<email address>]>
 */
$config['code-WXAPPUU'] = [ // code-$k
	/****************************** 公共参数 ******************************/
	/** 成功 */
	0 => [
		'code' => 0,
		'errMsg' => '执行成功', // 默认成功
		'data' => []
	],	
	1 => [
		'code' => 1,
		'errMsg' => '执行成功', // 其他成功
		'data' => []
	],	
	2 => [
		'code' => 3,
		'errMsg' => '执行成功', // 其他成功
		'data' => []
	],	
	3 => [
		'code' => 3,
		'errMsg' => '执行成功', // 其他成功
		'data' => []
	],
	/** 错误 */
	-1 => [
		'code' => -1,
		'errMsg' => '请求参数错误',
	],	
	-2 => [
		'code' => -2,
		'errMsg' => 'KEY 错误',
	],

	/****************************** 用户体系： 10000~10099 ******************************/
	10000 => [
		'code' => 10000,
		'errMsg' => '获取openid失败',
	],
	10001 => [
		'code' => 10001,
		'errMsg' => '获取session_key失败',
	],
	10002 => [
		'code' => 10002,
		'errMsg' => '新增用户失败',
	],
	10003 => [
		'code' => 10003,
		'errMsg' => '[获取unionId失败]签名校验缺少参数',
	],
	10004 => [
		'code' => 10004,
		'errMsg' => '[获取unionId失败]用户session无效',
	],
	10005 => [
		'code' => 10005,
		'errMsg' => '[获取unionId失败]签名校验失败',
	],
	10006 => [
		'code' => 10006,
		'errMsg' => '[获取unionId失败]解密数据为空',
	],
	10007 => [
		'code' => 10007,
		'errMsg' => '[获取unionId失败]解密数据不含unionId',
	],
	10008 => [
		'code' => 10008,
		'errMsg' => '[获取unionId失败]客户端错误',
	],
	10009 => [
		'code' => 10009,
		'errMsg' => '用户不存在',
	],
	10010 => [
		'code' => 10010,
		'errMsg' => '获取用户信息失败',
	],
	10011 => [
		'code' => 10011,
		'errMsg' => '手机号码格式错误',
	],
	10012 => [
		'code' => 10012,
		'errMsg' => '绑定用户手机号码失败',
	],
	10013 => [
		'code' => 10013,
		'errMsg' => '获取密码失败',
	],
	10014 => [
		'code' => 10014,
		'errMsg' => '解密手机号码错误',
	],
	10015 => [
		'code' => 10015,
		'errMsg' => '解密手机号码为空',
	],
	10016 => [
		'code' => 10016,
		'errMsg' => '用户未存在启动失败的设备',
	],
	10017 => [
		'code' => 10017,
		'errMsg' => '授权码或者刷新令牌二选一',
	],
	10018 => [
		'code' => 10018,
		'errMsg' => '换取授权访问令牌发生错误',
	],
	10019 => [
		'code' => 10019,
		'errMsg' => '获取用户信息错误',
	],
	10020 => [
		'code' => 10020,
		'errMsg' => '解密数据签名错误',
	],
	10021 => [
		'code' => 10021,
		'errMsg' => '解密数据签名错误',
	],
	10022 => [
		'code' => 10022,
		'errMsg' => '获取手机号出错',
	],
	10023 => [
		'code' => 10023,
		'errMsg' => '用户余额信息不存在',
	],
	10024 => [
		'code' => 10024,
		'errMsg' => '充币请先授权手机号码',
	],

	/****************************** 设备： 10100～10199 ******************************/
	10100 => [
		'code' => 10100,
		'errMsg' => '设备不存在',
	],
	10101 => [
		'code' => 10101,
		'errMsg' => '设备正在准备中，请换一个设备使用...',
	],
	10102 => [
		'code' => 10102,
		'errMsg' => '获取密码中...',
	],
	10103 => [
		'code' => 10103,
		'errMsg' => '文案不存在，获取密码失败',
	],
	10104 => [
		'code' => 10104,
		'errMsg' => '设备密码不存在',
	],
	10105 => [
		'code' => 10105,
		'errMsg' => '设置密码失败',
	],
	10106 => [
		'code' => 10106,
		'errMsg' => '更新密码失败',
	],
	10107 => [
		'code' => 10107,
		'errMsg' => '密码本不存在',
	],
	10108 => [
		'code' => 10108,
		'errMsg' => '设备信息有误',
	],
	10109 => [
		'code' => 10109,
		'errMsg' => '设备正在维修中， 请换设备使用...',
	],
	10110 => [
		'code' => 10110,
		'errMsg' => '设备故障， 请换设备使用...',
	],
	10111 => [
		'code' => 10111,
		'errMsg' => '设备重试中，继续等待或者申请退款',
	],
	10112 => [
		'code' => 10112,
		'errMsg' => '设备解锁失败',
	],
	10113 => [
		'code' => 10113,
		'errMsg' => '设备解锁发生错误',
	],
	10114 => [
		'code' => 10114,
		'errMsg' => '解锁设备失败',
	],
	10115 => [
		'code' => 10115,
		'errMsg' => '设备三元组信息不存在',
	],
	10116 => [
		'code' => 10116,
		'errMsg' => '设备正在使用中...',
	],
	10117 => [
		'code' => 10117,
		'errMsg' => '设备正在维修中， 请换设备使用...',
	],
	10118 => [
		'code' => 10118,
		'errMsg' => '设备正在维修中， 请换设备使用...',
	],
	10119 => [
		'code' => 10119,
		'errMsg' => '设备正在维修中， 请换设备使用...',
	],
	10120 => [
		'code' => 10120,
		'errMsg' => '设备异常， 请换设备使用...',
	],
	10121 => [
		'code' => 10121,
		'errMsg' => '用户无剩余时间',
	],
	10122 => [
		'code' => 10122,
		'errMsg' => '操作设备类型不存在',
	],

	/****************************** 商品：10200～10299 ******************************/
	10200 => [
		'code' => 10200,
		'errMsg' => '商品不存在',
	],

	/****************************** 订单：10300～10399 ******************************/
	10300 => [
		'code' => 10300,
		'errMsg' => '订单不存在',
	],
	10301 => [
		'code' => 10301,
		'errMsg' => '统一下单失败',
	],
	10302 => [
		'code' => 10302,
		'errMsg' => '订单创建失败',
	],
	10303 => [
		'code' => 10303,
		'errMsg' => '取消支付失败',
	],
	10304 => [
		'code' => 10304,
		'errMsg' => '上报充电时间失败',
	],
	10305 => [
		'code' => 10305,
		'errMsg' => '订单无效',
	],
	10306 => [
		'code' => 10306,
		'errMsg' => '申请退款失败',
	],
	10307 => [
		'code' => 10307,
		'errMsg' => '已申请退款',
	],
	10308 => [
		'code' => 10308,
		'errMsg' => '更新状态失败',
	],
	10309 => [
		'code' => 10309,
		'errMsg' => '已申请退款',
	],
	10310 => [
		'code' => 10310,
		'errMsg' => '下单失败-设备的代理商信息不存在',
	],
	10311 => [
		'code' => 10311,
		'errMsg' => '下单失败-商品不匹配',
	],
	10312 => [
		'code' => 10312,
		'errMsg' => '还未收到支付通知，请继续等待',
	],
	10313 => [
		'code' => 10313,
		'errMsg' => '用户充值订单失败',
	],
	10314 => [
		'code' => 10314,
		'errMsg' => '当前充币余额不足，请继续充币或者使用第三方支付',
	],


	/****************************** 附件：10400～10499 ******************************/

	10400 => [
		'code' => 10400,
		'errMsg' => '上传失败', # 初始化失败
	],
	10401 => [
		'code' => 10401,
		'errMsg' => '类型错误',
	],
	10402 => [
		'code' => 10402,
		'errMsg' => '页面来源错误',
	],
	10403 => [
		'code' => 10403,
		'errMsg' => '上传错误',
	],
	10404 => [
		'code' => 10404,
		'errMsg' => '上传错误',
	],
	10405 => [
		'code' => 10405,
		'errMsg' => '保存错误',
	],

	/****************************** 意见反馈：10500～10520 ******************************/
	10500 => [
		'code' => 10500,
		'errMsg' => '反馈失败',
	],
	10501 => [
		'code' => 10501,
		'errMsg' => '不能超过300个字符',
	],

	/******************************** 代理商：10521-10599 *****************************/
	10521 => [
		'code' => 10521,
		'errMsg' => '代理商不存在' // 代理商不存在
	],

	/******************************** 活动：10600-10699 *****************************/
	10600 => [
		'code' => 10600,
		'errMsg' => '此活动不存在' // 代理商不存在
	],


	
];
























